<template>
  <div class="sticker-page">
    <Sticker @showConfirmModal="showConfirmModal" />

    <div class="content">
      <h1>Страница со стикером</h1>
      <ImageCarousel :imageUrls="imageUrls" />
      <section
        v-for="section in sections"
        :key="section.id"
        class="content-section"
      >
        <h2>{{ section.title }}</h2>
        <p>{{ section.content }}</p>
      </section>

      <NuxtLink to="/" class="btn"> Вернуться на главную </NuxtLink>
    </div>
  </div>
</template>

<script setup lang="ts">
import { useModalStore } from "~/stores/modal";
const modalStore = useModalStore();

const imageUrls = [
  "vid-ocarovatel-noi-persidskoi-domasnei-koski.jpg",
  "milyi-bengal-skii-kot-smotrit-vverh.jpg",
  "uvlekatel-nyi-obraz-zizni-koski.jpg",
];

const showConfirmModal = () => {
  modalStore.showModal(
    "Кошки обладают удивительными способностями и характеристиками: они могут видеть в темноте, слышать ультразвуковые звуки, а их носы имеют уникальный узор, как отпечатки пальцев человека. Кошки спят до 70% своей жизни, имеют больше костей, чем люди, и используют усы для ориентации в пространстве. Также кошки не могут различать сладкий вкус, а их способность к мурлыканью может быть громче закипающего чайника. ",
    "Сообщение",
    true
  );
};

interface InfoType {
  id: number;
  title: string;
  content: string;
}
const sections: InfoType[] = [
  {
    id: 1,
    title: "Бенгальская кошка",
    content:
      "Мощное и вытянутое тело с хорошо развитой мускулатурой, костяк крепкий, лапы средней длины. Голова пропорциональная по отношению к туловищу с хорошо развитыми челюстями. Уши довольно короткие с широким основанием, расположены максимально широко. Глаза округлые, яркие и выразительные.",
  },
  {
    id: 2,
    title: "Бурманская кошка",
    content:
      "Стандарты породы: кошки средних размеров, плотного телосложения, мышечный каркас прекрасно развит, его подчеркивает гладкая шерсть, плотно прилегающая к мышечному телу. Туловище средних размеров, лапы тонкие, заканчиваются аккуратными подушечками овальной формы. Спина прямая, хвост средней длины, тоже прямой, сужающийся к круглому кончику. Широко поставленные уши крупных размеров, наклонены вперед, широкое основание ушей оканчивается округлыми кончиками. Мех - одно из главных достоинств бурманских кошек. Разрез янтарных глаз создает впечатление взгляда исподлобья, глаза широко поставлены. Голова клиновидной формы, имеет мягкие очертания. Хорошо заметные скулы широко поставлены. Нижняя челюсть и подбородок сильные и хорошо развиты.",
  },
  {
    id: 3,
    title: "Пиксибоб",
    content:
      "Кошки породы пиксибоб обладают рысеподобным внешним видом с маленьким хвостом. В итоге были выведены определенные характерные черты породы, которые включают в себя следующие: размер кошек варьируется от средних до крупных, самцы массивнее и крупнее самок, их вес достигает 6-10 кг, самок- 4-6 кг. Кошки имею крупное и крепкое тело, лапы тоже крупные и сильные, иногда наблюдается многопальцевость или полидактилия, при которой пальцы хорошо развиты, словно ладонь маленького ребенка. Голова имеет грушевидную форму, развитые выступающие надбровные дуги и мощный нависающий лоб создают эффект сурового взгляда как у дикой кошки. Глаза глубоко посажены, могут быть круглой или миндалевидной формы желто-зеленого или золотисто-зеленого иногда просто зеленого цвета. Уши среднего размера, на концах кисточки черного или коричневого цвета как у рыси. Крупные щеки и мощный подбородок с бородкой. Как у рыси и короткий, словно обрубленный хвост, длиной 2,5 см. Узор полосато-пятнистый, пятнистый или розеткой тэбби коричневого или черного цвета, который располагается на руфическом или неруфическом фоне. Они позднее других домашних кошек достигают половозрелости, также, как и дикие кошки, в помете рождается 2-3 котенка, редко 4 и более.",
  },
  {
    id: 4,
    title: "Сноу-шу",
    content:
      "Вывести чистую породу сноу-шу довольно непросто, это связано с тем, что ген, отвечающий за белый цвет не является доминантным и при его двойном размере белого цвета получается слишком много, или наоборот- слишком мало, а то и нет совсем. Не просто получить красивый сиамский рисунок и окрас. Оптимально, если окрас имеет стандарт сил-поинт или блю-поинт, бывают еще шоколадный и палевый окрасы, но они размываются белым и выглядят менее эффектно. Еще одной обязательной характеристикой чистой породы сноу-шу является выведение необходимого телосложения кошки, которое должно сочетать в себе вытянутую форму тела сиамской породы и крупные размеры массивной американской короткошерстной. Глаза у кошек должны быть только голубыми, за любой другой цвет грозит дисквалификация. Голова имеет треугольную форму с черными отметинами, крупные уши также имеет треугольную форму, заостренные к концам, хвост средней длины. Здоровье у кошек этой породы крепкое, а темперамент спокойный и уравновешенный, эти характеристики им достались от американской короткошерстной. ",
  },
  {
    id: 5,
    title: "Бомбей",
    content:
      "Если Вас всегда манила и завораживала красота дикой черной пантеры, Вы восхищаетесь ее грациозностью, а атласный черный мех привлекает Вас своей таинственной притягательной силой. Если взгляд горящих медных глаз гипнотизирует и увлекает Вас в загадочные дали диких джунглей, то кошка породы бомбей создана специально для Вас. Особенностью строения бомбеев является достаточно большой вес при миниатюрных размерах, тело мускулистое, крепкая костная система, хвост средней длины, круглые широко расставленные глаза от медного до золотистого оттенка, голова круглая. Форма головы бывает двух видов: традиционная форма - более узкая вытянутая морда, современная - менее вытянутая. Уши средних размеров, широко поставлены и наклонены вниз. Черная шикарная шерсть бомбеев блестит, короткая и мягкая она словно бархат создает впечатление изысканности и эксклюзивности породы. В качестве стандарта принят только черный окрас, однако в помете встречаются и соболиные окрасы шерсти, унаследованные от соболиных бурманцев. Черный окрас доминантный, но даже если сам котенок черный в будущем, если его ген, отвечающий за окрас, смешан с соболиным, он может дать потомство с соболиным окрасом, с вероятностью 50 на 50. Бомбеи - это выбор людей с утонченным вкусом, стремящихся подчеркнуть свою индивидуальность и ценящих эксклюзивность во всем.",
  },
];
</script>

<style scoped lang="scss">
.sticker-page {
  min-height: 200vh;
}

.content {
  max-width: 800px;
  margin: 0 auto;
  padding: $padding-base;
  display: flex;
  flex-direction: column;
  gap: 3rem;
  h1 {
    text-align: center;
  }
  &-section {
    background: white;
    border-radius: 12px;
    box-shadow: 0 2px 8px rgba(0, 0, 0, 0.1);
    padding: $padding-base;
    h2 {
      margin-bottom: 1rem;
    }
  }
}
</style>
